sears04/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/include/data";

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform ($Ux $Uy 0);

boundaryField
{
    entrada
    {
    	type            uniformFixedValue;
    	uniformValue    sine;

    	frequency       $freq;
    	start           0;

    	amplitude
    	{
        	type        constant;
        	value       ($Ax $Ay 0);
    	}

    	level
    	{
        	type        constant;
        	value       ($Ux $Uy 0);
    	}
    }


    salida
    {
    	type            uniformFixedValue;
    	uniformValue    sine;

    	frequency       $freq;
    	start           0;

    	amplitude
    	{
        	type        constant;
        	value       ($Ax $Ay 0);
    	}

    	level
    	{
        	type        constant;
        	value       ($Ux $Uy 0);
    	}
    }



    naca0012
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
