sears04/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.1;
        smoother        GaussSeidel;
	nPreSweeps 	0;
	nPostSweeps 	2;
	cacheAgglomeration on;
	agglomerator faceAreaPair;
	nCellsInCoarsestLevel 1000;
	mergeLevels 1;
    }

    pFinal
    {
	solver 		GAMG;
	tolerance 	1e-06;
	relTol 		0.0;
	smoother        GaussSeidel;
	nPreSweeps 	0;
	nPostSweeps 	2;
	cacheAgglomeration on;
	agglomerator faceAreaPair;
	nCellsInCoarsestLevel 1000;
	mergeLevels 1;
    } 

    U
    {
        solver          PBiCGStab;
	preconditioner 	DILU;
        tolerance       1e-08;
        relTol          0.1;
    }

    UFinal
    {
        solver          PBiCGStab;
	preconditioner 	DILU;
        tolerance       1e-08;
        relTol          0.1;
    }

    nuTilda
    {
        solver          smoothSolver;
	smoother 	GaussSeidel;
	nSweeps 	2;
        tolerance       1e-08;
        relTol          0.0;
    }

    nuTildaFinal
    {
        solver          smoothSolver;
	smoother 	GaussSeidel;
	nSweeps 	2;
        tolerance       1e-08;
        relTol          0.0;
    }

}

PIMPLE
{
    nOuterCorrectors 3;
    nNonOrthogonalCorrectors 1;
    nCorrector 3;

    residualControl
    {
        p               1e-5;
        U               1e-5;
        nuTilda         1e-5;
    }
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.8;
        nuTilda         0.3;
    }
}


// ************************************************************************* //
